Autodesk.Revit.DB.RepeaterBounds.AdjustForCyclicalBounds(Autodesk.Revit.DB.RepeaterCoordinates)
Shifts the input coordinates in the cyclical dimensions so that they fall in the [lower bounds, upper bounds] range.
Remarks:
The coordinates must have the same number of dimensions as the bounds.
This method does not apply to zero dimensional bounds.
coordinates:
The coordinates.
Returns:
The adjusted coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The coordinates coordinates have incompatible number of dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bounds must have at least one dimension.
Since:
2014

Autodesk.Revit.DB.RepeaterBounds.AreCoordinatesInBounds(Autodesk.Revit.DB.RepeaterCoordinates,System.Boolean)
Determines whether given coordinates are within the bounds.
Remarks:
The coordinates must have the same number of dimensions as the bounds.
This method does not apply to zero dimensional bounds.
coordinates:
The coordinates.
treatCyclicalBoundsAsInfinite:
True if cyclical directions should be treated as unbounded.
Returns:
True if the coordinates are within the bounds.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The coordinates coordinates have incompatible number of dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bounds must have at least one dimension.
Since:
2014